In [1]:
#BASICS
a=(30,23)

In [2]:
type(a)

tuple

In [3]:
list=[2,5,7,9]

In [4]:
list[3]

9

In [5]:
marks=[90,55,34,89,67,23]

In [6]:
pass_mark=35

In [7]:
marks[1]<pass_mark

False

In [8]:
for mark in marks:
    print(mark)
    if mark<pass_mark:
        print("fail")
    else:
        print("pass")
    print("*********************")

90
pass
*********************
55
pass
*********************
34
fail
*********************
89
pass
*********************
67
pass
*********************
23
fail
*********************

In [9]:
range(5)

range(0, 5)

In [10]:
x=range(2,15,4)
for i in x:
    print(i)

2
6
10
14

In [11]:
def foo_sum(a,b):
    return a+b

In [12]:
foo_sum(9,4)

13

In [13]:
def foo_diff(a,b):
    print(a)
    return a-b

In [14]:
foo_diff(50,30)

50

20

In [ ]:
#PYTHON FOR DS

In [25]:
import pandas as pd
import numpy as np

In [26]:
marks

[90, 55, 34, 89, 67, 23]

In [28]:
marks_series=pd.Series(marks)

In [29]:
marks_series

0    90
1    55
2    34
3    89
4    67
5    23
dtype: int64

In [30]:
marks_series[:4]

0    90
1    55
2    34
3    89
dtype: int64

In [31]:
marks_series.value_counts()

34    1
90    1
67    1
23    1
89    1
55    1
dtype: int64

In [33]:
sample_df = pd.DataFrame([marks,marks]).T

In [34]:
sample_df

    0   1
0  90  90
1  55  55
2  34  34
3  89  89
4  67  67
5  23  23

In [35]:
sample_df.columns=['marks1','marks2']

In [36]:
sample_df

   marks1  marks2
0      90      90
1      55      55
2      34      34
3      89      89
4      67      67
5      23      23

In [38]:
df=pd.read_excel(r"C:\Users\DELL\Documents\q2.xlsx",sheet_name="expected_output")

In [39]:
df

,Order_Number,Friend_Id,Salary_($/PM),Total_Salary,Salary_Proportion,Total_Bill_Value_($),Bill_Contribution
0,1,1,4000,10000,0.400000,100,40.000000
1,1,2,6000,10000,0.600000,100,60.000000
2,2,1,3000,17500,0.171429,200,34.285714
3,2,2,5000,17500,0.285714,200,57.142857
4,2,3,8000,17500,0.457143,200,91.428571
5,2,4,1000,17500,0.057143,200,11.428571
6,2,5,500,17500,0.028571,200,5.714286
7,3,1,3500,3500,1.000000,150,150.000000
8,3,2,0,3500,0.000000,150,0.000000
9,3,3,0,3500,0.000000,150,0.000000

In [40]:
df.head()

,Order_Number,Friend_Id,Salary_($/PM),Total_Salary,Salary_Proportion,Total_Bill_Value_($),Bill_Contribution
0,1,1,4000,10000,0.400000,100,40.000000
1,1,2,6000,10000,0.600000,100,60.000000
2,2,1,3000,17500,0.171429,200,34.285714
3,2,2,5000,17500,0.285714,200,57.142857
4,2,3,8000,17500,0.457143,200,91.428571

In [41]:
df.tail()

,Order_Number,Friend_Id,Salary_($/PM),Total_Salary,Salary_Proportion,Total_Bill_Value_($),Bill_Contribution
5,2,4,1000,17500,0.057143,200,11.428571
6,2,5,500,17500,0.028571,200,5.714286
7,3,1,3500,3500,1.000000,150,150.000000
8,3,2,0,3500,0.000000,150,0.000000
9,3,3,0,3500,0.000000,150,0.000000

In [43]:
type(df)

pandas.core.frame.DataFrame

In [45]:
df['Friend_Id'].value_counts()

1    3
2    3
3    2
4    1
5    1
Name: Friend_Id, dtype: int64

In [46]:
df.isna().sum()

Order_Number            0
Friend_Id               0
Salary_($/PM)           0
Total_Salary            0
Salary_Proportion       0
Total_Bill_Value_($)    0
Bill_Contribution       0
dtype: int64

In [47]:
df.columns

Index(['Order_Number', 'Friend_Id', 'Salary_($/PM)', 'Total_Salary',
       'Salary_Proportion', 'Total_Bill_Value_($)', 'Bill_Contribution'],
      dtype='object')

In [48]:
marks

[90, 55, 34, 89, 67, 23]

In [54]:
sname = pd.Series(['aaa','bbb','ccc','ddd'])
marks = pd.Series([90,55,47,10,34])
dic={'sno':sname, 'marksobtained':marks}

In [55]:
df1=pd.DataFrame(dic)

In [56]:
df1

   sno  marksobtained
0  aaa             90
1  bbb             55
2  ccc             47
3  ddd             10
4  NaN             34

In [59]:
df1.corr()

               marksobtained
marksobtained            1.0